
# encoding: utf-8
# language: ru

Функционал: <описание фичи>

Как <Роль>
Я хочу <описание функционала> 
Чтобы <бизнес-эффект> 

Контекст: 
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий


Сценарий: <описание сценария> 

	Когда открылось окно "Начальная страница"
	И     В форме "Сотрудники и начисления" в таблице "СписокСотрудников" я перехожу к строке:
	| 'Подразделение'                      | 'Таб. номер' | 'Дата приема' | 'Должность'                                                              | 'ФИО'                          |
	| 'Отдел разработки финансового блока' | '009       ' | '16.10.2014'  | 'Архитектор информационной системы /Отдел разработки финансового блока/' | 'Ганиев Станислав Тальгатович' |
	И     В форме "Сотрудники и начисления" в ТЧ "СписокСотрудников" я выбираю текущую строку
	Тогда открылось окно "Ганиев Станислав Тальгатович (Сотрудник)"
	И     я нажимаю на кнопку "Семья"
	Тогда открылось окно "Ганиев Станислав Тальгатович: Семья"
	И     в ТЧ "РодственникиФизическихЛиц" я активизирую поле "Дата рождения"
	И     В форме "Ганиев Станислав Тальгатович: Семья" в ТЧ "РодственникиФизическихЛиц" я выбираю текущую строку
	Тогда открылось окно "Ганиева Екатерина Николаевна (Родственник)"
	И     в поле "Дата рождения" я ввожу текст "11.01.1982"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Ганиев Станислав Тальгатович: Семья"
	И     Я закрываю окно "Ганиев Станислав Тальгатович: Семья"
	Тогда открылось окно "Ганиев Станислав Тальгатович (Сотрудник)"
	И     я нажимаю на кнопку "Личная карточка (Т-2)"
	Тогда открылось окно "Печать документа"
	И     Я закрываю окно "Печать документа"
	Тогда открылось окно "Ганиев Станислав Тальгатович (Сотрудник)"
	И     я нажимаю на кнопку "Склонения"
	Тогда открылось окно "Склонения по падежам"
	И     я нажимаю на кнопку "Отмена"
	Тогда открылось окно "Ганиев Станислав Тальгатович (Сотрудник)"
	И     Я закрываю окно "Ганиев Станислав Тальгатович (Сотрудник)"
